"""Обов’язкові вимоги до виконання завдань
В усіх задачах цієї лабораторної роботи потрібно
•    побудувати рекурентне співвідношення (за необхідності, якщо воно явно не задане в умові задачі);
•    описати генератор-функцію для генерування членів заданої послідовності;
•    описати програму обчислення необхідного члена послідовності використовуючи цикл з лічильником або цикл з умовою."""


def gen(N):
    a1 = 1
    S = a1/2
    yield S

    a2 = 1
    S += a2/4
    yield S

    a3 = 1
    S += a3 / 8
    yield S

    for n in range(4, N + 1):
        ak = a3 + a1
        a1 = a2
        a2 = a3
        a3 = ak

        S += ak / (2 ** n)

        yield S


if __name__ == '__main__':
    n = int(input("n= "))

    for elem in gen(n):
        print(elem)
        el = elem

    print('---------')
    print(el)