"""Обов’язкові вимоги до виконання завдань
В усіх задачах цієї лабораторної роботи потрібно
•    побудувати рекурентне співвідношення (за необхідності, якщо воно явно не задане в умові задачі);
•    описати генератор-функцію для генерування членів заданої послідовності;
•    описати програму обчислення необхідного члена послідовності використовуючи цикл з лічильником або цикл з умовою."""


def gen(a,b, N):
    D1 = a+b
    yield D1

    D2 = (a+b) ** 2 - a*b
    yield D2

    for n in range(3, N + 1):
        D = (a+b) * D2 - a*b * D1
        D1 = D2
        D2 = D
        yield D


if __name__ == '__main__':
    a = int(input("a= "))
    b = int(input("b= "))
    n = int(input("n= "))

    for elem in gen(a,b,n):
        print(elem)
        el = elem

    print('---------')
    print(el)