"""Обов’язкові вимоги до виконання завдань
В усіх задачах цієї лабораторної роботи потрібно
•    побудувати рекурентне співвідношення (за необхідності, якщо воно явно не задане в умові задачі);
•    описати генератор-функцію для генерування членів заданої послідовності;
•    описати програму обчислення необхідного члена послідовності використовуючи цикл з лічильником або цикл з умовою."""

import math

x = 0.5
eps = 0.001

S = 0
a = x
n = 1

while abs(a) >= eps:
    S += a
    n += 2
    a = x**n / n


res = 2 * S
res_math = math.log((1 + x) / (1 - x))

print(f"{res = }, {n=}")
print(f"{res_math = }")