"""Обов’язкові вимоги до виконання завдань
В усіх задачах цієї лабораторної роботи потрібно
•    побудувати рекурентне співвідношення (за необхідності, якщо воно явно не задане в умові задачі);
•    описати генератор-функцію для генерування членів заданої послідовності;
•    описати програму обчислення необхідного члена послідовності використовуючи цикл з лічильником або цикл з умовою."""


def gen(x, N):
    xk = 1 # повернення 0-го члена
    yield xk

    for k in range(1, N + 1):
        xk *= x**2 / ((2*k+2) * (2*k+1))
        yield xk # повернення k-го члена


if __name__ == '__main__':
    x = float(input("x= "))
    n = int(input("n= "))


    for elem in gen(x, n):
        print(elem)
        el = elem

    print('---------')
    print(el)